Autodesk.Revit.DB.BaseImportOptions.SetLayerSelection(System.Collections.Generic.ICollection`1{System.String})
Set the layers name which user want to import into Revit.
Remarks:
If user don't set any layer selection, all layers would be imported into Revit for dgn.
But for dwg|dxf, all layers (or visible layers, it is up to visibleLayersOnly was set or not) would be imported into Revit.
layerSelection:
The layers imported into Revit.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.BaseImportOptions.GetRefPoint
Gets the 3D point in the document where the imported instance will be inserted.
Since:
2013

Autodesk.Revit.DB.BaseImportOptions.SetRefPoint(Autodesk.Revit.DB.XYZ)
Sets the 3D point in the document where the imported instance will be inserted.
If not explicitly set, the instance will be inserted at the document origin.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013